/*
 *  Информация о государствах мира
 */
var about=["Государство", "Столица", "Континент", "Часть света",  "Разница во времени",  
           "Денежная единица",  "Географические объекты",  "Литературные произведения",
		   "Исторические события"];
	   
var countries=[
  ["Италия", "Рим", "Евразия", "Европа", -2, "итальянская лира", 
    ["Альпы", "Пальмария", "Апеннинский полуостров", "Комо", "Тальяменто"], 
    [["Джованни Верга", "Жизнь среди полей", 1880], ["Анна Виванти", "Цирцея", 1912], ["Джузеппе Понтиджа", "Рождённые дважды", 2000]],
	{"1882":"избирательная реформа", "1945":"антифашистское восстание, 18-28 апреля"}
  ],
  ["Франция", "Париж", "Евразия", "Европа", -1, "евро", 
    ["Эндр", "Пиренеи", "Луара", "Альпы", "Бискайский залив"], 
    [["Александр Дюма", "Граф Монте-Кристо", 1845], ["Жюль Габриэль Верн", "Завещание чудака", 1900], ["Луи Анри Буссенар", "Капитан Сорви-голова", 2001], ["Морис Самюэль Роже Шарль Дрюон", "Тисту — мальчик с зелеными пальцами", 1957]],
	{"1572":"Варфоломеевская ночь", "1648":"Вестфальский мир", "1914":"Марнское сражение, 5-12 сентября"}
  ],
  ["Швейцария", "отсутствует", "Евразия", "Европа", -1, "Швейцарский франк", 
    ["Бильское озеро", "Рейхенбахский водопад", "Альпы", "Алечский ледник"], 
    [["Иоханна Спири", "Хайди: годы странствий и учёбы", 1880], ["Герман Гессе", "Игра в бисер", 1942], ["Макс Фриш", "Homo Фабер", 1957], ["Мелинда Надь Абонджи", "Голуби взлетают", 2010]],
	{"1291":"основание Швейцарии", "1844":"начало работы первой железнодорожной линией"}
  ],
  ["Венгрия", "Будапешт", "Евразия", "Европа", -1, "Венгерский форинт", 
    ["Геллерт", "Карпаты", "Веленце", "Мезёфёльд"], 
    [["Янош Бачаньи", "Мужество венгров", 1785], ["Аттила Бартиш", "Спокойствие", 2001], ["Ийеш Дьюла", "Двое мужчин", 1950]],
	{"1222":"подписание Эндре II «Золотой буллы»", "1867":"Коронование Франца-Иосифа в Будапеште по старым обычаям, 8 июня"}
  ],
  ["Румыния", "Бухарест", "Евразия", "Европа", 0, "Румынский лей", 
    ["Олт", "Трансильванское плато", "Карпаты", "Медвежья пещера", "Бабеле"], 
    [["Михаил Садовяну", "Золотая ветвь", 1933], ["Мирча Элиаде", "Изабель и воды дьявола", 1930]],
	{"1881":"Румыния была провозглашена королевством", "1990":"первые свободные президентские и парламентские выборы", "2004":"Румыния стала членом НАТО"}
  ],
  ["Япония", "Токио", "Евразия", "Азия", 6, "японская иена", 
    ["Фудзияма", "Сакурадзима", "Абукума"], 
	[["Сюсаку Эндо", "Море и яд", 1958], ["Юдзо Ямамото", "Профессор Цумура", 1919], ["Марико Хасиока", "Аут", 1997]],
	{"1872":" отменена сложного и строгого сословного деления", "1904":"японский флот атаковал русскую эскадру в Порт-Артуре", "1941":"атака на Пёрл-Харбор"}
  ],
  ["Афганистан", "Кабул", "Евразия", "Азия", 1.5, "афгани", 
    ["Намакзар", "Дашти-Марго", "Фарахруд", "Гиндукуш"], 
    [["Гуль Пача Ульфат", "Голос сердца", 1962], ["Абдуррауф Бенава", "Горестные размышления", 1957], ["Махмуд-бек Тарзи", "Путешествия через три континента за 29 дней", 1914]],
	{"1973":"провозглашение Республики, 17 июля", "2004":"новая Конституция и проведены первые президентские выборы"}
  ],
  ["Индия", "Нью-Дели", "Евразия", "Азия", 2.5, "Индийская рупия", 
    ["Ганг", "Гуру-Сикар", "Дудхсагар", "Цо-Морари", "Деканские траппы"],  
    [["Арундати Рой", "Бог мелочей", 1997], ["Хушвант Сингх", "Поезд в Пакистан", 1956]],
	{"1857":"Восстание Сипаев", "1617":"Британская Ост-Индская компания получила право торговать с Индией", "1948":"Операция «Поло»", "1986":"архитектурное наследие Хампи включено в список Всемирного наследия"}
  ],
  ["Бразилия", "Бразилиа", "Южная Америка", "Америка", -6, "риал", 
    ["Тапажос", "Пантанал", "пампа", "Сейшас", "Параноа"], 
    [["Лима Баррето", "Жалкий конец Поликарпо Кваресма", 1911], ["Эрику Верисиму", "Происшествие в Антаресе", 1971], ["Шику Буарки", "Будапешт ", 2003], ["Жоаким Мануэл ди Маседу","Смуглянка", 1844]],
	{"1888":"Золотой закон об отмене рабства в Бразилии, 13 мая", "1935":"вооружённое выступление бразильских коммунистов и тенентистов"}
  ],
  ["Канада", "Оттава", "Северная Америка", "Америка", -7, "канадский доллар", 
    ["Фанди", "Подкова", "Элсмир", "Невольничье озеро", "Оттава"], 
    [["Филип Майкл Ондатже", "Английский пациент", 1992], ["Маргарет Этвуд", "Up In The Tree", 1978]],
	{"1608":"основание города Квебек", "1838":"Битва за ветряную мельницу", "1867":"Канада получила право формировать собственное правительство"}
  ],
  ["Аргентина", "Буэнос-Айрес", "Южная Америка", "Америка", -6, "аргентинское песо", 
    ["Охос-дель-Саладо", "Огненная земля", "Пампа", "Лагунас-де-Гуанакаче"], 
    [["Хорхе Луис Борхес", "Фунес памятливый", 1942]],
	{"1912":"закон о всеобщем избирательном праве", "1871":"Завоевание пустыни", "1810":"Аргентинская война за независимость"}
  ],
  ["Колумбия", "Богота", "Южная Америка", "Америка", -8, "колумбийское песо", 
    ["Кристобаль-Колон", "Магдалена", "Каука", "Анды", "Льянос"], 
    [["Рафаэль Помбо", "Флибустьеры", 1856], ["Хосе Эустасио Ривера", "Вихрь", 1924], ["Лаура Рестрепо", "Леопард на солнце", 1993]],
	{"1916":"обнаружены богатейшие запасы нефти", "1549":"образование королевской аудиенсии и канцелярии Санта-Фе де Боготы", "1886":"принята консервативная конституция"}
  ],
  ["Англия", "Лондон", "", "", -3, "фунт стерлингов", 
    ["Тис", "Белые клифы Дувра", "Саут-Даунс", "Скофелл-Пайк"], 
    [["Майн Рида", "Огненная земля", 1883], ["Уильям Шекспир", "Ромео и Джульетта", 1595], ["Оскар Уайльд", "Портрет Дориана Грея", 1891], ["Джонатан Свифт", "Путешествия в некоторые удалённые страны мира в четырёх частях: сочинение Лемюэля Гулливера, сначала хирурга, а затем капитана нескольких кораблей", 1726]],
	{"1701":"Акт о престолонаследии", "1455":"начало войны Алой и Белой розы", "1215":"Великая хартия вольностей"}
  ],
  ["Мексика", "Мехико", "Южная Америка", "Америка", -9, "мексиканское песо", 
    ["Попокатепетль", "Калифорния", "Эль-Вискаино", "Сонора", "Чапала", "Гуадалупе", "Пещера Ласточек"], 
    [["Октавио Пас", "Salamandra", 1962], ["Амадо Нерво", "Недвижная возлюбленная", 1922], ["Карлос Фуэнтес", "Смерть Артемио Круса", 1962], ["Хуан Рульфо", "Педро Парамо", 1955]],
	{"1810":"Мексиканская война за независимость", "1536":"открытие коллегиума Санта-Крус де Тлателолько", "2006":"Революция кактусов"}
  ]   
];
window.onload = function(){
	function outArrayData (country){
		tab_new="";
		if (typeof country == "string")
			tab_new +=country;
		else{
			tab_new += country[0]+"<br>&#171;"+country[1]+"&#187;<br>("+country[2]+");";
		}
		return tab_new;
	}

	function makeTableFromCountry (countries){
		i=2;
		
		tab="<table width=100%>";
		tab+="<tr><td bgcolor = #C0C0C0><h1 align=center>"+countries[0]+"-"+countries[1]+"</h1></td>";
		tab+="<tr><td><table width = 75% align=center>";
		tab+="<tr><td>"+about[2]+"</td><td>"+countries[2]+"</td></tr>";
		tab+="<tr><td>"+about[3]+"</td><td>"+countries[3]+"</td></tr>";
		tab+="<tr><td>"+about[4]+"</td><td>"+countries[4]+"</td></tr>";
		tab+="<tr><td>"+about[5]+"</td><td>"+countries[5]+"</td></tr>";
		
		tab+="</td></table>";
		var gObj=countries[6].map(outArrayData);
		tabl="<tr><td><table align=center>";
		tabl+="<td valign = top>"+about[6]+"</td>";
		tabl+="<td>"
		gObj.map(
		   function(item){tabl+="<p>&#1010"+i+";"+item+"</p>"; i++;});
		tabl+="</td>";
		tabl+="</td></table>";
		tab+=tabl;
		
		i=2;
		
		var gObj=countries[7].map(outArrayData);
		tabl="<tr><td><table align=center>";
		tabl+="<td valign = top>"+about[7]+"</td>";
		tabl+="<td>";
		gObj.map(
		   function(item){tabl+="<p>&#1010"+i+";"+item+"</p>"; i++;});
		tabl+="</td>";
		tabl+="</td></table>";
		tab+=tabl;
		
		tab+="<tr><td align = center><b>Исторические события</b>";
		tab+="<table border = 1 width=100%>"
		tab+="<tr>";
		keys = Object.keys(countries[8]);
		for (var i = 0, l = keys.length; i < l; i++) {
			tab +="<td>"+keys[i] + '-' + countries[8][keys[i]] + "</td>";
		}
		tab+="</tr>";
		tab+="</table>";
		tab+="</table>";
		return tab;
	}

	var radio2=document.getElementsByName("2");
	for(var i=0;i<radio2.length;i++){
		radio2[i].onchange=changeOb;
	}
	
	var slider=document.getElementsByName("time");
	for(var i=0;i<slider.length;i++){
	  slider[i].onchange=changeReg;
	}

	function changeReg(){
	  if(radio2[1].checked==true){
	  obj2.changeCountries(this.value);
	  refreshReg(memR1_2,this.value);}
	  else{obj2.changeCountries.call(obj1,this.value);
		refreshReg(memR1_1,this.value);}
	  runLab();
	}

	function refreshReg(ar,value){
		ar[0]=value;
		var timeO = document.getElementById('div1');
		timeO.innerHTML=slider[0].value;
	}
	
	var but1=document.querySelector('#but1');
	but1.onclick=cancelReg;

	function cancelReg(){
	  if(radio2[0].checked==true){
		obj1.countries=deepCop(obj1.countries,countries);
		memR1_1.forEach(function(el,i,ar){ar[i]=0;});
	  }
		else{obj2=new Changes();
		  memR1_2.forEach(function(el,i,ar){ar[i]=0;});}
		runLab();
		var timeO = document.getElementById('div1');
		timeO.innerHTML=slider[0].value;
	}

	function changeOb(){runLab();}

	obj1={
	   countries: deepCop(this.countries,countries),
	   outCountries: 
		  function(){
			var div=document.getElementById('1');
			var coutrtab=this.countries.map(makeTableFromCountry);
			var index = select.selectedIndex; 
			div.innerHTML=coutrtab[index];
		  }
		}

	function Changes() {
	   this.countries=deepCop(this.countries,countries);
	   this.changeCountries=function(data){
		this.countries.forEach(function(el) {
				if(el.some(element => typeof element == "number" && element > data))
					rec_foo(el,data);
		  });
	  }
	  atat:42;
	}
	var obj2 = new Changes();
	
	function rec_foo(ar,data){
	  for(var i in ar){
		if(typeof ar[i]==="string"){
			ar[i]=ar[i].toUpperCase();
		}
		else {
		  if(typeof ar[i]==="object"){
		  rec_foo(ar[i],data);
		 }}
	  }
	}

	var select = document.getElementById('sel1');         
	var op_sel = select.getElementsByTagName('option');   
	for (var i = 0; i < countries.length; i++) {
		let op_cre = document.createElement('option');     
		select.append(op_cre);                              
		op_sel[i].innerHTML=countries[i][0];                
	}
	
	function deepCop(newEl,oldEl){
	  if(typeof oldEl === "object"){
		  if(Array.isArray(oldEl)){newEl=oldEl.slice();}
		  else{newEl=Object.assign({},oldEl);}
		  for(var i in oldEl){
			newEl[i]=deepCop(newEl[i],oldEl[i]);
		  }
		}
		return newEl;
	}

	var memR1_1=[0],memR1_2=[0];
	
	function autoChReg(newS){
		slider.forEach(function(el){el.value=0;});
		slider[0].value=newS;
		var timeO = document.getElementById('div1');
		timeO.innerHTML=slider[0].value;
	}

	function runLab(){
	  if(radio2[0].checked==true){
		autoChReg(memR1_1);
		obj1.outCountries();
		var objOut = document.getElementById('div2');
		objOut.innerHTML="Object 1";
		}
	  else{
		autoChReg(memR1_2);
		obj1.outCountries.call(obj2);
		var objOut = document.getElementById('div2');
		objOut.innerHTML="Object 2";
		}
	}
	radio2[0].checked=true;
	select.onchange=runLab;
	runLab();
}